Revit 2026 API

# DefinitionGroups Class

---

A specialized set of definition groups that allows creation of new groups.

SystemObject Autodesk.Revit.DBDefinitionGroups

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DefinitionGroups : IEnumerable<DefinitionGroup>,
	IDisposable
```
```vb
Public Class DefinitionGroups
	Implements IEnumerable(Of DefinitionGroup), IDisposable
```
```cpp
public ref class DefinitionGroups : IEnumerable<DefinitionGroup^>,
	IDisposable
```
```fsharp
type DefinitionGroups =
    class
        interface IEnumerable<DefinitionGroup>
        interface IDisposable
    end
```

The DefinitionGroups type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Identifies if the definition groups collection is empty. |
|  | Item | Retrieve a definition group by name. |
|  | Size | The number of definition groups in the collection. |

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Tests for the existence of a definition group within the collection. |
|  | Create | Create a new parameter definition group using the name provided. |
|  | Dispose | Releases all resources used by the DefinitionGroups |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Retrieves an enumerator to the collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace